nginx新手指南

####nginx 概述

 * nginx是一个基于事件模型并且依赖于操作系统特性的服务器（譬如，在linux平台我们可以使用epoll来提高请求处理能力）；
 
 * nginx启动时通常会创建一个master进程和多个worker进程，其中master进程主要用来读取，加载配置文件以及管理worker进程，而work进程则是用来处理客户端请求；  

 * worker进程的数目可以在配置文件中指定，建议使用机器的cpu数作为worker进程数
  
  


####nginx 启动，关闭止以及重载配置
启动nginx服务器：

    nginx     
    nginx -c nginx_conf_path

第一个命令使用默认配置文件（通常是: /etc/nginx/nginx.conf）启动nginx，而第二个命令使用自定义配置文件启动nginx  

关闭nginx服务器：

    nginx -s stop --- 暴力的关闭服务器
    nginx -s quit --- 安全的关闭服务器

上面的两个命令的区别在于，第二个命令会让nginx处理完当前正在处理的请求，然后关闭服务器

有时候nginx正在运行，然后我们因为某些问题修改了配置文件，这时候我们希望新配置立即生效该怎么办呢？ 显然我可以们先关闭然后重新启动服务器（这时候它会加载到新的配置），但这种做法太麻烦，而且会在短时间内造成服务不可用（若没有集群）  
  
nginx本身提供了一种优雅的方式，使用下列命令，可以动态加载新配置：

    nginx -s reload
    
一旦master进程收到该信号（重载），它首先检查新配置语法的正确性，然后尝试加载它；如果一切OK，master开始用新配置去创建新的worker进程，并且告诉老的worker进程：嗨，哥么，你处理完手头的事就可以闪了；worker进程收到master程发来的该消息就会处理完正在处理的请求然后退出，之后nginx就以新配置状态运行







